# 4.5 Data Consistency Checks

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

In [2]:
df_prods= pd.read_csv(r'C:\Users\willi\5-2023 Instacart Basket Analysis\Data\Original Data\4.3_orders_products\products.csv', index_col = False)

In [3]:
df_ords= pd.read_csv(r'C:\Users\willi\5-2023 Instacart Basket Analysis\Data\Prepared Data\orders_wrangled.csv', index_col = False)

In [4]:
#Mixed-type data

In [6]:
#Create a data frame
df_test=pd.DataFrame()

In [8]:
#Create a mixed-type colomn
df_test['mix']=['a', 'b', 1, True]

In [9]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [10]:
#Check for mixed-types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [11]:
df_test['mix'] = df_test['mix'].astype('str')

In [12]:
#Missing values

In [13]:
#Finding missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [14]:
#Create new dataframe of missing values
df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [15]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [16]:
#Addressing Missing Values

In [20]:
#Create a new variable
df_nan.describe()

         product_id    aisle_id  department_id     prices
count     16.000000   16.000000      16.000000  16.000000
mean    6684.000000   89.937500      10.937500  13.012500
std    12836.665242   33.731229       4.639953   3.881731
min       34.000000   26.000000       1.000000   1.200000
25%      459.250000   70.750000       7.750000  12.175000
50%     2413.000000   98.500000      11.500000  13.650000
75%     3872.750000  120.000000      14.500000  14.425000
max    40440.000000  126.000000      16.000000  20.900000

In [ ]:
#Replace with mean
df['column with missings'].fillna(mean value, inplace=True)

In [ ]:
#Replace with median
df['column with missings'].fillna(median value, inplace=True)

In [21]:
df_prods.shape

(49693, 5)

In [22]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [23]:
df_prods_clean.shape

(49677, 5)

In [ ]:
#Drop missing values
df_prods.dropna(inplace = True)

In [ ]:
#Drop missing missing values from particular column
df_prods.dropna(subset = [‘product_name’], inplace = True)

In [ ]:
#Duplicates

In [24]:
#Finding duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [25]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [26]:
df_prods_clean.shape

(49677, 5)

In [27]:
#Dropping duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [28]:
df_prods_clean_no_dups.shape

(49672, 5)

In [29]:
path=r'C:\Users\willi\5-2023 Instacart Basket Analysis'

In [30]:
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Data','Prepared Data', 'products_checked.csv'))